# Connect to DataBase

In [1]:
# Import libraries of interest 
import pandas as pd
import numpy as np 
import numpy.random as rand
import mysql.connector
import random
import math
import pymysql
import sqlalchemy
from sqlalchemy import create_engine

In [2]:
# Enter your password...
password = 'Baseball5757'

In [3]:
# For using pd.read_sql
connection = pymysql.connect(
        host = '127.0.0.1',
        port =  3306,
        user = 'root',
        password = password,
        database = 'cville_climbs'
    )
cnx = create_engine('mysql+pymysql://root:'+password+'@localhost:3306/cville_climbs')

In [4]:
# Connect to SQL database on your computer for writing to SQL
conn = mysql.connector.connect(user='root', password=password, host='127.0.0.1', database='cville_climbs')
cursor = conn.cursor() # Enable access to mySQL

# Create Tables

In [41]:
# Remove all tables from database 
destroy_tables = '''
DROP TABLE IF EXISTS 
route, location, log, route_setting, person, route_setter, admin, climber 
'''
cursor.execute(destroy_tables)
conn.commit()

In [42]:
# Create location table 
create_location = '''
CREATE TABLE location 
(location_id INT NOT NULL AUTO_INCREMENT,
 latitude DECIMAL(10,8) NOT NULL,
 longitude DECIMAL(10,8) NOT NULL, 
 name VARCHAR(64) NOT NULL,
 entrance_city VARCHAR(255),
 entrance_zip VARCHAR(255),
 entrance_address VARCHAR(255),
 num_routes INT NOT NULL,
 PRIMARY KEY (location_id),
 CONSTRAINT Check_Location CHECK (-180<longitude AND longitude<180 AND -90<latitude AND latitude<90));
'''
cursor.execute(create_location)
conn.commit()


# Create person table 
create_person = '''
CREATE TABLE person
(person_id INT NOT NULL AUTO_INCREMENT,
 f_name VARCHAR(32) NOT NULL,
 l_name VARCHAR(32) NOT NULL,
 initial VARCHAR(3) NOT NULL, 
 email VARCHAR(64) NOT NULL,
 phone BIGINT(10) NOT NULL,
 PRIMARY KEY (person_id));
'''
cursor.execute(create_person)
conn.commit()


# Create route table
create_route = '''
CREATE TABLE route 
(route_id INT NOT NULL AUTO_INCREMENT, 
 name VARCHAR(64) NOT NULL, 
 difficulty DECIMAL(10,8) NOT NULL,
 rating DECIMAL,
 type enum('indoor','outdoor') NOT NULL,
 location_id INT NOT NULL,
 PRIMARY KEY (route_id),
 FOREIGN KEY (location_id) REFERENCES location (location_id), 
 CONSTRAINT check_rating CHECK (rating>=0 AND rating<=10),
 CONSTRAINT check_difficulty CHECK (difficulty>=0 AND difficulty<=6));
'''
cursor.execute(create_route)
conn.commit()


# Create log table 
create_log = '''
CREATE TABLE log 
(log_id INT NOT NULL AUTO_INCREMENT, 
 person_id INT NOT NULL, 
 comment LONGTEXT NOT NULL,
 route_beta LONGTEXT,
 route_id INT NOT NULL,
 PRIMARY KEY (log_id),
 FOREIGN KEY (route_id) REFERENCES route(route_id),
 FOREIGN KEY (person_id) REFERENCES person(person_id));
'''
cursor.execute(create_log)
conn.commit()


# Create route_setting table 
create_route_setting = '''
CREATE TABLE route_setting
(route_id INT NOT NULL,
 person_id INT NOT NULL,
 PRIMARY KEY (route_id, person_id),
 FOREIGN KEY (route_id) REFERENCES route(route_id),
 FOREIGN KEY (person_id) REFERENCES person(person_id));
'''
cursor.execute(create_route_setting)
conn.commit()


# Create route setter table
create_route_setter = '''
CREATE TABLE route_setter
(person_id INT NOT NULL,
 n_routes_created INT NOT NULL,
 route_setting_exp_lvl DECIMAL NOT NULL,
 certifications LONGTEXT,
 PRIMARY KEY (person_id),
 FOREIGN KEY (person_id) REFERENCES person (person_id));
'''
cursor.execute(create_route_setter)
conn.commit()


# Create climber table 
create_climber = '''
CREATE TABLE climber
(person_id INT NOT NULL,
 exp_lvl DECIMAL NOT NULL, 
 routes_attempted INT NOT NULL,
 is_team_member BOOLEAN NOT NULL,
 PRIMARY KEY (person_id),
 FOREIGN KEY (person_id) REFERENCES person (person_id));
'''
cursor.execute(create_climber)
conn.commit()


# Create administrator table 
create_admin = '''
CREATE TABLE admin
(person_id INT NOT NULL,
 has_edit_permission BOOLEAN NOT NULL, 
 has_delete_permission BOOLEAN NOT NULL, 
 has_create_permission BOOLEAN NOT NULL, 
 is_owner BOOLEAN NOT NULL,
 PRIMARY KEY (person_id),
 FOREIGN KEY (person_id) REFERENCES person (person_id));
'''
cursor.execute(create_admin)
conn.commit()

# Print out all of the create statements 
print(create_location)
print(create_person)
print(create_route)
print(create_log)
print(create_route_setting)
print(create_route_setter)
print(create_climber)
print(create_admin)

CREATE TABLE location
(location_id INT NOT NULL AUTO_INCREMENT,
 latitude DECIMAL(10,8) NOT NULL,
 longitude DECIMAL(10,8) NOT NULL,
 name VARCHAR(64) NOT NULL,
 entrance_city VARCHAR(255),
 entrance_zip VARCHAR(255),
 entrance_address VARCHAR(255),
 num_routes INT NOT NULL,
 PRIMARY KEY (location_id),
 CONSTRAINT Check_Location CHECK (-180<longitude AND longitude<180 AND -90<latitude AND latitude<90));


CREATE TABLE person
(person_id INT NOT NULL AUTO_INCREMENT,
 f_name VARCHAR(32) NOT NULL,
 l_name VARCHAR(32) NOT NULL,
 initial VARCHAR(3) NOT NULL,
 email VARCHAR(64) NOT NULL,
 phone BIGINT(10) NOT NULL,
 PRIMARY KEY (person_id));


CREATE TABLE route
(route_id INT NOT NULL AUTO_INCREMENT,
 name VARCHAR(64) NOT NULL,
 difficulty DECIMAL(10,8) NOT NULL,
 rating DECIMAL,
 type enum('indoor','outdoor') NOT NULL,
 location_id INT NOT NULL,
 PRIMARY KEY (route_id),
 FOREIGN KEY (location_id) REFERENCES location (location_id),
 CONSTRAINT check_rating CHECK (rating>=0 AND rating<=10),
 CONSTRAINT check_difficulty CHECK (difficulty>=0 AND difficulty<=6));


CREATE TABLE log
(log_id INT NOT NULL AUTO_INCREMENT,
 person_id INT NOT NULL,
 comment LONGTEXT NOT NULL,
 route_beta LONGTEXT,
 route_id INT NOT NULL,
 PRIMARY KEY (log_id),
 FOREIGN KEY (route_id) REFERENCES route(route_id),
 FOREIGN KEY (person_id) REFERENCES person(person_id));


CREATE TABLE route_setting
(route_id INT NOT NULL,
 person_id INT NOT NULL,
 PRIMARY KEY (route_id, person_id),
 FOREIGN KEY (route_id) REFERENCES route(route_id),
 FOREIGN KEY (person_id) REFERENCES person(person_id));


CREATE TABLE route_setter
(person_id INT NOT NULL,
 n_routes_created INT NOT NULL,
 route_setting_exp_lvl DECIMAL NOT NULL,
 certifications LONGTEXT,
 PRIMARY KEY (person_id),
 FOREIGN KEY (person_id) REFERENCES person (person_id));


CREATE TABLE climber
(person_id INT NOT NULL,
 exp_lvl DECIMAL NOT NULL,
 routes_attempted INT NOT NULL,
 is_team_member BOOLEAN NOT NULL,
 PRIMARY KEY (person_id),
 FOREIGN KEY (person_id) REFERENCES person (person_id));


CREATE TABLE admin
(person_id INT NOT NULL,
 has_edit_permission BOOLEAN NOT NULL,
 has_delete_permission BOOLEAN NOT NULL,
 has_create_permission BOOLEAN NOT NULL,
 is_owner BOOLEAN NOT NULL,
 PRIMARY KEY (person_id),
 FOREIGN KEY (person_id) REFERENCES person (person_id));

# Generate Data

In [43]:
# Function to generate climb names 
first_name = ['willy','ron','shrimp','nano','egret','cozy','perry',
              'darnel','michael','grace','zach','veer','tyler','sherry',
              'rachel','andrew','abi','alyssa','brooke','alex','andy']
last_name = ['parnel','patel','clift','key','dixon','vincil',
             'lloyd','scott','halpert','beesly','bridges','stanmeyer',
             'porter','kelly','lebo','stewart']
adj = ['indubious','scary-ass','incredible','lame-ass','hard-ass',
       'piece-of-cake','cringy','timid','terrible','inspiring','awful',
       'tricky','downright-difficult']
noun = ['bluff','squeeze','tumble','hurdle','boulder-problem',
         'challenge','manuever','scramble','hike','ascent']
email = ['hotmail','gmail','yahoo','b2x.online']
parks = ['blueridge','appalachain','shenendoah','smoky','george washington',
         'montauk','luray','crozet','charlottesville','old rag','humpback','mcafees']
park_2 = ['national park', 'state park', 'nature preserve', 'reservoir', 'park', 
          'mountain', 'rocks', 'preserve', 'wildlife preserve']
initial = ['a.','b.','c.','d.','e.','f.','g.','h.','i.','l.','m.','n.',
          'o.','p.','r.','s.','t.','w.','v.']
list_names = [first_name, initial, last_name]
list_climbs = [first_name, adj, noun]

# Returns a string of climb names 
def generate_climbs():
    name = ''
    i = 0
    for sublist in list_climbs:
        idx = rand.randint(0,len(sublist))
        if i==0:
            name+=sublist[idx]+"'s"
        else: 
            name+=' '+sublist[idx]
        i+=1
    return name

# Returns a tuple of first, middle initial and last name 
def generate_person():
    name = []
    for sublist in list_names:
        idx = rand.randint(0,len(sublist))
        name.append(sublist[idx])
    return name[0], name[1], name[2]

# Return email address 
def generate_email(f_name,l_name):
    idx = rand.randint(0, len(email))
    address = email[idx]
    return f_name+'_'+l_name+'@'+address+'.com'
    
# Return phone number
def generate_phone(base=434):
    return int(str(base)+str(rand.randint(1000000,9999999)))

# Generate Location coordinates 
def generate_coords():
    lat = random.uniform(-77.5,-79.5)
    long = random.uniform(-37,-39)
    return lat, long

# Generate a location name
def generate_location_names():
    return parks[random.randint(0,len(parks)-1)] +' '+ park_2[random.randint(0,len(park_2)-1)]

In [44]:
# Set hyperparameters for data generation 
n_obs_people = 15
n_obs_routes = 40
n_obs_location = 10

In [45]:
# GENERATE LOCATIONS DATA 
location_dataframe = pd.read_sql('location', con=cnx)
for i in range(n_obs_location):
    lat, long = generate_coords()
    vals = {'location_id':i+1, 'latitude':lat,'longitude':long,'name':generate_location_names(),'entrance_city':np.nan,
           'entrance_zip':np.nan, 'entrance_address':np.nan,'num_routes':np.nan}
    location_dataframe = location_dataframe.append(vals, ignore_index=True)

# GENERATE ROUTE DATA 
route_dataframe = pd.read_sql('route', con=cnx)
for i in range(n_obs_routes):
    climb_diff = random.choice(np.linspace(4,6,21))
    climb_rate = random.choice(np.linspace(4,10,13))
    location_id = random.choice(location_dataframe['location_id'].to_list())
    vals = {'route_id':i+1, 'name':generate_climbs(),'difficulty':climb_diff, 'rating':climb_rate, 
           'type':'outdoor', 'location_id':location_id}
    route_dataframe = route_dataframe.append(vals, ignore_index=True)
def try_location(key):
    data = route_dataframe.groupby('location_id').apply(len).to_dict()
    a = 0
    try:
        data[key]
    except:
        pass
    else: 
        a = data[key]
    return a
location_dataframe['num_routes'] = location_dataframe.location_id.apply(try_location)

# GENERATE PEOPLE DATA 
people_dataframe = pd.read_sql('person', con=cnx)
for i in range(n_obs_people):
    f,m,l =generate_person()
    mail=generate_email(f,l)
    phone=generate_phone()
    vals = {'person_id':i+1,'f_name':f, 'l_name':l, 'initial':m, 'email':mail, 'phone':phone}
    people_dataframe = people_dataframe.append(vals, ignore_index=True)

# GENERATE CLIMBER DATA 
climber_dataframe = pd.read_sql('climber', con=cnx)
pct_climbers = .9
climbers_list = people_dataframe.sample(int(pct_climbers*len(people_dataframe)))['person_id'].to_list()
for i in range(len(climbers_list)):
    max_v = len(route_dataframe)
    routes_attempted = rand.randint(0,max_v)
    vals = {'person_id':climbers_list[i],
            'exp_lvl':min(10, round((1-math.tanh((max_v-routes_attempted)/max_v))*9 + 2*rand.uniform(),1)),
            'routes_attempted':routes_attempted, 
            'is_team_member':rand.choice([True,False],p=[.7,.3])}
    climber_dataframe = climber_dataframe.append(vals, ignore_index=True)

# GENERATE ROUTE SETTING data 
route_setting_dataframe = pd.read_sql('route_setting', con=cnx)
route_setters_list = climber_dataframe.sort_values('exp_lvl',ascending=False).sample(int(.3*len(climber_dataframe)))['person_id'].to_list()
for i in range(len(route_dataframe)):
    randn_setters = random.randint(1,len(route_setters_list))
    person_ids = rand.choice(route_setters_list)
    for j in range(randn_setters):
        person = route_setters_list[j]
        route = route_dataframe['route_id'].iloc[i]
        vals = {'route_id':route,'person_id':person}
        route_setting_dataframe = route_setting_dataframe.append(vals, ignore_index=True)

# GENERATE ROUTE SETTER data 
route_setter_dataframe = pd.read_sql('route_setter', con=cnx)
person_ids = route_setting_dataframe.groupby('person_id').apply(len).index.to_list()
n_routes = route_setting_dataframe.groupby('person_id').apply(len).to_list()
for i in range(len(person_ids)):
    max_v = max(n_routes)
    vals = {'person_id':person_ids[i],
            'n_routes_created':n_routes[i],
            'route_setting_exp_lvl':min(10, round((1-math.tanh((max_v-n_routes[i])/max_v))*9 + 1*rand.uniform(),1))}
    route_setter_dataframe = route_setter_dataframe.append(vals, ignore_index=True)

# GENERATE ADMIN data
admin_list = people_dataframe.loc[people_dataframe.person_id.apply(lambda x: x not in climbers_list),'person_id'].to_list()+climber_dataframe.sample(2)['person_id'].to_list()
admin_dataframe = pd.read_sql('admin', con=cnx)
for i in range(len(admin_list)):
    vals = {'person_id':admin_list[i],
            'has_edit_permission':rand.choice([True,False],p=[.9,.1]),
            'has_delete_permission':rand.choice([True,False],p=[.9,.1]),
            'has_create_permission':rand.choice([True,False],p=[.9,.1]),
            'is_owner':rand.choice([True,False],p=[.1,.9])}
    admin_dataframe = admin_dataframe.append(vals, ignore_index=True)
    
# GENERATE LOG DATA 
n_logs = 5
log_dataframe = pd.read_sql('log', con=cnx)
log_dataframe['log_id'] = [1,2,3,4,5]
log_dataframe['person_id'] = rand.choice(climber_dataframe.loc[climber_dataframe['routes_attempted']!=0,'person_id'].to_list(),n_logs)
log_dataframe['comment'] = ['lots of fun, very easy course',
                             'hella dangerous without proper equipment',
                             'name is deceptive: easiest course at blueridge',
                             'too easy not worth the drive',
                             'more of a steep climb with small amounts of bouldering']
log_dataframe['route_beta'] = ['toe hook on sharp ledge marked with chalk',
                               'dyno from hold marked 2 onto blue overhang marked 5',
                               'use the crack to the left of red marker as primary hand hold',
                               'karate kick over between boulders',
                               'mantle blue ledge']
log_dataframe['route_id'] = rand.choice(route_dataframe.loc[:,'route_id'].to_list(),n_logs)

# Insert Data into Database

In [46]:
# Insert all people records
for i in range(len(people_dataframe)):
    row_entry = str(people_dataframe.iloc[i].to_list()[1:]).replace("]",")").replace("[","(")
    columns = str(people_dataframe.columns[1:].to_list()).replace("]",")").replace("[","(").replace("'","")
    command = "INSERT INTO person "+columns+" VALUES "+row_entry
    print("INSERT INTO person "+columns,"\nVALUES "+row_entry+';')
    cursor.execute(command)
    conn.commit()

INSERT INTO person (f_name, l_name, initial, email, phone)
VALUES ('zach', 'patel', 'v.', 'zach_patel@yahoo.com', 4345622994);
INSERT INTO person (f_name, l_name, initial, email, phone)
VALUES ('alex', 'scott', 's.', 'alex_scott@gmail.com', 4341949978);
INSERT INTO person (f_name, l_name, initial, email, phone)
VALUES ('veer', 'beesly', 'v.', 'veer_beesly@b2x.online.com', 4341284980);
INSERT INTO person (f_name, l_name, initial, email, phone)
VALUES ('rachel', 'scott', 'g.', 'rachel_scott@gmail.com', 4346215110);
INSERT INTO person (f_name, l_name, initial, email, phone)
VALUES ('nano', 'beesly', 'w.', 'nano_beesly@b2x.online.com', 4348662127);
INSERT INTO person (f_name, l_name, initial, email, phone)
VALUES ('cozy', 'patel', 'r.', 'cozy_patel@b2x.online.com', 4349915027);
INSERT INTO person (f_name, l_name, initial, email, phone)
VALUES ('zach', 'scott', 'i.', 'zach_scott@yahoo.com', 4344049457);
INSERT INTO person (f_name, l_name, initial, email, phone)
VALUES ('cozy', 'scott', 'l.', 'cozy_scott@yahoo.com', 4349487103);
INSERT INTO person (f_name, l_name, initial, email, phone)
VALUES ('ron', 'vincil', 'b.', 'ron_vincil@hotmail.com', 4348590255);
INSERT INTO person (f_name, l_name, initial, email, phone)
VALUES ('darnel', 'lebo', 'o.', 'darnel_lebo@gmail.com', 4349819850);
INSERT INTO person (f_name, l_name, initial, email, phone)
VALUES ('abi', 'parnel', 'o.', 'abi_parnel@hotmail.com', 4347644975);
INSERT INTO person (f_name, l_name, initial, email, phone)
VALUES ('abi', 'stewart', 'h.', 'abi_stewart@gmail.com', 4346433420);
INSERT INTO person (f_name, l_name, initial, email, phone)
VALUES ('ron', 'lloyd', 'v.', 'ron_lloyd@yahoo.com', 4348657984);
INSERT INTO person (f_name, l_name, initial, email, phone)
VALUES ('egret', 'stewart', 'h.', 'egret_stewart@hotmail.com', 4347786244);
INSERT INTO person (f_name, l_name, initial, email, phone)
VALUES ('andrew', 'porter', 'a.', 'andrew_porter@yahoo.com', 4343246027);

In [47]:
# Insert all location records 
for i in range(len(location_dataframe)):
    row_entry = str(location_dataframe.iloc[i].to_list()[1:]).replace("]",")").replace("[","(").replace(' nan,','')
    columns = str(['latitude', 'longitude', 'name', 'num_routes'])\
                .replace("]",")").replace("[","(").replace("'","")
    command = "INSERT INTO location "+columns+" VALUES "+row_entry
    print("INSERT INTO location "+columns,"\nVALUES "+row_entry+';')
    cursor.execute(command)
    conn.commit()

INSERT INTO location (latitude, longitude, name, num_routes)
VALUES (-77.87743452097769, -37.25146865215822, 'montauk state park', 7);
INSERT INTO location (latitude, longitude, name, num_routes)
VALUES (-78.77302573692634, -37.18968822331554, 'mcafees reservoir', 6);
INSERT INTO location (latitude, longitude, name, num_routes)
VALUES (-78.92249308399882, -37.82116632935441, 'george washington rocks', 5);
INSERT INTO location (latitude, longitude, name, num_routes)
VALUES (-78.57676649730314, -38.10528986713639, 'mcafees national park', 3);
INSERT INTO location (latitude, longitude, name, num_routes)
VALUES (-79.40465190786584, -38.86254260063368, 'appalachain nature preserve', 1);
INSERT INTO location (latitude, longitude, name, num_routes)
VALUES (-78.4832882756912, -38.518816070142776, 'charlottesville preserve', 3);
INSERT INTO location (latitude, longitude, name, num_routes)
VALUES (-77.6019031816802, -37.906484648449876, 'george washington preserve', 2);
INSERT INTO location (latitude, longitude, name, num_routes)
VALUES (-78.78874877680677, -38.19521901533354, 'mcafees rocks', 7);
INSERT INTO location (latitude, longitude, name, num_routes)
VALUES (-79.44451602447512, -38.789354308730395, 'blueridge mountain', 2);
INSERT INTO location (latitude, longitude, name, num_routes)
VALUES (-78.08688251990857, -38.42164021672905, 'appalachain preserve', 4);

In [48]:
# Insert all route data 
for i in range(len(route_dataframe)):
    row_entry = str(route_dataframe.iloc[i].to_list()[1:]).replace("]",")").replace("[","(")
    columns = str(['name', 'difficulty', 'rating', 'type', 'location_id'])\
                .replace("]",")").replace("[","(").replace("'","")
    command = "INSERT INTO route "+columns+" VALUES "+row_entry
    print("INSERT INTO route "+columns,"\nVALUES "+row_entry+';')
    cursor.execute(command)
    conn.commit()

INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("abi's lame-ass squeeze", 4.0, 5.0, 'outdoor', 2);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("grace's timid tumble", 5.3, 4.5, 'outdoor', 8);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("sherry's hard-ass manuever", 4.9, 8.0, 'outdoor', 10);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("veer's terrible squeeze", 5.3, 4.0, 'outdoor', 1);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("andrew's timid squeeze", 5.0, 5.5, 'outdoor', 9);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("andy's inspiring hike", 4.2, 9.5, 'outdoor', 6);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("darnel's piece-of-cake boulder-problem", 4.3, 7.0, 'outdoor', 8);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("tyler's indubious scramble", 4.8, 8.0, 'outdoor', 10);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("abi's downright-difficult challenge", 5.1, 6.5, 'outdoor', 5);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("andrew's incredible tumble", 5.2, 10.0, 'outdoor', 2);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("cozy's indubious challenge", 4.8, 6.0, 'outdoor', 2);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("shrimp's scary-ass manuever", 5.0, 7.0, 'outdoor', 2);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("nano's piece-of-cake tumble", 4.1, 8.0, 'outdoor', 8);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("nano's incredible squeeze", 5.3, 4.0, 'outdoor', 9);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("willy's downright-difficult hike", 5.8, 10.0, 'outdoor', 1);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("willy's downright-difficult manuever", 4.8, 9.0, 'outdoor', 3);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("willy's tricky tumble", 5.4, 7.5, 'outdoor', 4);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("sherry's awful ascent", 4.0, 7.5, 'outdoor', 8);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("alex's scary-ass scramble", 4.1, 6.5, 'outdoor', 2);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("andrew's terrible manuever", 5.3, 5.5, 'outdoor', 8);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("nano's inspiring ascent", 4.1, 4.0, 'outdoor', 7);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("darnel's tricky boulder-problem", 5.5, 8.5, 'outdoor', 3);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("alex's timid scramble", 4.3, 5.0, 'outdoor', 1);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("rachel's tricky scramble", 4.8, 5.5, 'outdoor', 10);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("sherry's tricky boulder-problem", 4.0, 9.0, 'outdoor', 1);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("darnel's scary-ass hike", 4.9, 10.0, 'outdoor', 1);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("shrimp's cringy tumble", 5.7, 4.5, 'outdoor', 3);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("shrimp's incredible bluff", 6.0, 6.0, 'outdoor', 10);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("zach's lame-ass ascent", 4.9, 5.0, 'outdoor', 8);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("andrew's lame-ass manuever", 4.0, 5.0, 'outdoor', 1);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("cozy's lame-ass tumble", 4.5, 7.5, 'outdoor', 2);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("michael's downright-difficult boulder-problem", 5.6, 4.5, 'outdoor', 7);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("perry's downright-difficult hurdle", 5.2, 9.0, 'outdoor', 8);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("alex's piece-of-cake challenge", 5.1, 4.5, 'outdoor', 3);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("perry's lame-ass tumble", 4.2, 5.0, 'outdoor', 1);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("alex's indubious hurdle", 5.7, 6.0, 'outdoor', 4);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("cozy's terrible scramble", 5.9, 8.5, 'outdoor', 6);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("cozy's hard-ass hurdle", 4.2, 6.5, 'outdoor', 3);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("zach's inspiring tumble", 5.3, 6.0, 'outdoor', 6);
INSERT INTO route (name, difficulty, rating, type, location_id)
VALUES ("willy's downright-difficult manuever", 5.5, 10.0, 'outdoor', 4);

In [49]:
# Insert all route_setter data 
for i in range(len(route_setting_dataframe)):
    row_entry = str(route_setting_dataframe.iloc[i].to_list()).replace("]",")").replace("[","(")
    columns = str(['route_id','person_id'])\
                .replace("]",")").replace("[","(").replace("'","")
    command = "INSERT INTO route_setting "+columns+" VALUES "+row_entry
    print(command+';')
    cursor.execute(command)
    conn.commit()

INSERT INTO route_setting (route_id, person_id) VALUES (1, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (1, 2);
INSERT INTO route_setting (route_id, person_id) VALUES (1, 4);
INSERT INTO route_setting (route_id, person_id) VALUES (2, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (2, 2);
INSERT INTO route_setting (route_id, person_id) VALUES (2, 4);
INSERT INTO route_setting (route_id, person_id) VALUES (3, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (4, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (5, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (5, 2);
INSERT INTO route_setting (route_id, person_id) VALUES (5, 4);
INSERT INTO route_setting (route_id, person_id) VALUES (6, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (6, 2);
INSERT INTO route_setting (route_id, person_id) VALUES (6, 4);
INSERT INTO route_setting (route_id, person_id) VALUES (7, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (8, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (8, 2);
INSERT INTO route_setting (route_id, person_id) VALUES (9, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (9, 2);
INSERT INTO route_setting (route_id, person_id) VALUES (10, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (10, 2);
INSERT INTO route_setting (route_id, person_id) VALUES (10, 4);
INSERT INTO route_setting (route_id, person_id) VALUES (11, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (11, 2);
INSERT INTO route_setting (route_id, person_id) VALUES (11, 4);
INSERT INTO route_setting (route_id, person_id) VALUES (12, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (13, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (14, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (14, 2);
INSERT INTO route_setting (route_id, person_id) VALUES (15, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (16, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (16, 2);
INSERT INTO route_setting (route_id, person_id) VALUES (16, 4);
INSERT INTO route_setting (route_id, person_id) VALUES (17, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (17, 2);
INSERT INTO route_setting (route_id, person_id) VALUES (17, 4);
INSERT INTO route_setting (route_id, person_id) VALUES (18, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (18, 2);
INSERT INTO route_setting (route_id, person_id) VALUES (18, 4);
INSERT INTO route_setting (route_id, person_id) VALUES (19, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (19, 2);
INSERT INTO route_setting (route_id, person_id) VALUES (20, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (20, 2);
INSERT INTO route_setting (route_id, person_id) VALUES (20, 4);
INSERT INTO route_setting (route_id, person_id) VALUES (21, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (22, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (22, 2);
INSERT INTO route_setting (route_id, person_id) VALUES (23, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (24, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (24, 2);
INSERT INTO route_setting (route_id, person_id) VALUES (24, 4);
INSERT INTO route_setting (route_id, person_id) VALUES (25, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (25, 2);
INSERT INTO route_setting (route_id, person_id) VALUES (26, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (26, 2);
INSERT INTO route_setting (route_id, person_id) VALUES (27, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (27, 2);
INSERT INTO route_setting (route_id, person_id) VALUES (28, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (28, 2);
INSERT INTO route_setting (route_id, person_id) VALUES (29, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (29, 2);
INSERT INTO route_setting (route_id, person_id) VALUES (29, 4);
INSERT INTO route_setting (route_id, person_id) VALUES (30, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (30, 2);
INSERT INTO route_setting (route_id, person_id) VALUES (30, 4);
INSERT INTO route_setting (route_id, person_id) VALUES (31, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (31, 2);
INSERT INTO route_setting (route_id, person_id) VALUES (32, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (32, 2);
INSERT INTO route_setting (route_id, person_id) VALUES (32, 4);
INSERT INTO route_setting (route_id, person_id) VALUES (33, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (33, 2);
INSERT INTO route_setting (route_id, person_id) VALUES (33, 4);
INSERT INTO route_setting (route_id, person_id) VALUES (34, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (35, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (35, 2);
INSERT INTO route_setting (route_id, person_id) VALUES (36, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (36, 2);
INSERT INTO route_setting (route_id, person_id) VALUES (36, 4);
INSERT INTO route_setting (route_id, person_id) VALUES (37, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (37, 2);
INSERT INTO route_setting (route_id, person_id) VALUES (37, 4);
INSERT INTO route_setting (route_id, person_id) VALUES (38, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (38, 2);
INSERT INTO route_setting (route_id, person_id) VALUES (38, 4);
INSERT INTO route_setting (route_id, person_id) VALUES (39, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (39, 2);
INSERT INTO route_setting (route_id, person_id) VALUES (40, 12);
INSERT INTO route_setting (route_id, person_id) VALUES (40, 2);

In [50]:
# Insert all route_setting data 
for i in range(len(route_setter_dataframe)):
    row_entry = str(route_setter_dataframe.iloc[i].to_list()).replace("]",")").replace("[","(").replace('nan','NULL')
    columns = str(['person_id','n_routes_created','route_setting_exp_lvl','certifications'])\
                .replace("]",")").replace("[","(").replace("'","")
    command = "INSERT INTO route_setter "+columns+" VALUES "+row_entry
    print(command+';')
    cursor.execute(command)
    conn.commit()

INSERT INTO route_setter (person_id, n_routes_created, route_setting_exp_lvl, certifications) VALUES (2.0, 31.0, 7.4, NULL);
INSERT INTO route_setter (person_id, n_routes_created, route_setting_exp_lvl, certifications) VALUES (4.0, 18.0, 4.7, NULL);
INSERT INTO route_setter (person_id, n_routes_created, route_setting_exp_lvl, certifications) VALUES (12.0, 40.0, 9.2, NULL);

In [51]:
# Insert all climber data 
for i in range(len(climber_dataframe)):
    row_entry = str(climber_dataframe.iloc[i].to_list()).replace("]",")").replace("[","(").replace('nan','NULL')
    columns = str(['person_id','exp_lvl','routes_attempted','is_team_member'])\
                .replace("]",")").replace("[","(").replace("'","")
    command = "INSERT INTO climber "+columns+" VALUES "+row_entry
    print(command+';')
    cursor.execute(command)
    conn.commit()

INSERT INTO climber (person_id, exp_lvl, routes_attempted, is_team_member) VALUES (6.0, 9.3, 38.0, 1.0);
INSERT INTO climber (person_id, exp_lvl, routes_attempted, is_team_member) VALUES (4.0, 4.8, 18.0, 1.0);
INSERT INTO climber (person_id, exp_lvl, routes_attempted, is_team_member) VALUES (3.0, 4.7, 18.0, 1.0);
INSERT INTO climber (person_id, exp_lvl, routes_attempted, is_team_member) VALUES (8.0, 10.0, 38.0, 1.0);
INSERT INTO climber (person_id, exp_lvl, routes_attempted, is_team_member) VALUES (11.0, 5.9, 17.0, 1.0);
INSERT INTO climber (person_id, exp_lvl, routes_attempted, is_team_member) VALUES (9.0, 6.9, 29.0, 1.0);
INSERT INTO climber (person_id, exp_lvl, routes_attempted, is_team_member) VALUES (2.0, 7.1, 25.0, 1.0);
INSERT INTO climber (person_id, exp_lvl, routes_attempted, is_team_member) VALUES (1.0, 6.6, 27.0, 0.0);
INSERT INTO climber (person_id, exp_lvl, routes_attempted, is_team_member) VALUES (10.0, 3.4, 11.0, 1.0);
INSERT INTO climber (person_id, exp_lvl, routes_attempted, is_team_member) VALUES (12.0, 10.0, 37.0, 1.0);
INSERT INTO climber (person_id, exp_lvl, routes_attempted, is_team_member) VALUES (13.0, 5.5, 18.0, 1.0);
INSERT INTO climber (person_id, exp_lvl, routes_attempted, is_team_member) VALUES (7.0, 7.8, 28.0, 1.0);
INSERT INTO climber (person_id, exp_lvl, routes_attempted, is_team_member) VALUES (14.0, 4.6, 14.0, 1.0);

In [52]:
# Insert all admin data  
for i in range(len(admin_dataframe)):
    row_entry = str(admin_dataframe.iloc[i].to_list()).replace("]",")").replace("[","(").replace('nan','NULL')
    columns = str(['person_id','has_edit_permission','has_delete_permission','has_create_permission','is_owner'])\
                .replace("]",")").replace("[","(").replace("'","")
    command = "INSERT INTO admin "+columns+" VALUES "+row_entry
    print("INSERT INTO admin "+columns,"\nVALUES "+row_entry+';')    
    cursor.execute(command)
    conn.commit()

INSERT INTO admin (person_id, has_edit_permission, has_delete_permission, has_create_permission, is_owner)
VALUES (5, 1, 1, 0, 0);
INSERT INTO admin (person_id, has_edit_permission, has_delete_permission, has_create_permission, is_owner)
VALUES (15, 1, 1, 1, 0);
INSERT INTO admin (person_id, has_edit_permission, has_delete_permission, has_create_permission, is_owner)
VALUES (11, 1, 1, 1, 0);
INSERT INTO admin (person_id, has_edit_permission, has_delete_permission, has_create_permission, is_owner)
VALUES (13, 1, 1, 1, 0);

In [53]:
# Insert all log data 
for i in range(len(log_dataframe)):
    row_entry = str(log_dataframe.iloc[i].to_list()[1:]).replace("]",")").replace("[","(").replace('nan','NULL')
    columns = str(['person_id','comment','route_beta','route_id'])\
                .replace("]",")").replace("[","(").replace("'","")
    command = "INSERT INTO log "+columns+" VALUES "+row_entry
    print("INSERT INTO log "+columns,"\nVALUES "+row_entry+';')    
    cursor.execute(command)
    conn.commit()

INSERT INTO log (person_id, comment, route_beta, route_id)
VALUES (14, 'lots of fun, very easy course', 'toe hook on sharp ledge marked with chalk', 26);
INSERT INTO log (person_id, comment, route_beta, route_id)
VALUES (13, 'hella dangerous without proper equipment', 'dyno from hold marked 2 onto blue overhang marked 5', 14);
INSERT INTO log (person_id, comment, route_beta, route_id)
VALUES (11, 'name is deceptive: easiest course at blueridge', 'use the crack to the left of red marker as primary hand hold', 16);
INSERT INTO log (person_id, comment, route_beta, route_id)
VALUES (6, 'too easy not worth the drive', 'karate kick over between boulders', 34);
INSERT INTO log (person_id, comment, route_beta, route_id)
VALUES (4, 'more of a steep climb with small amounts of bouldering', 'mantle blue ledge', 35);

# Retrieve your data

## Select all data

In [54]:
# Person Data Table
command = "SELECT * FROM person;"
print(command)
pd.read_sql(command,con=cnx)

SELECT * FROM person;

    person_id  f_name   l_name initial                       email       phone
0           1    zach    patel      v.        zach_patel@yahoo.com  4345622994
1           2    alex    scott      s.        alex_scott@gmail.com  4341949978
2           3    veer   beesly      v.  veer_beesly@b2x.online.com  4341284980
3           4  rachel    scott      g.      rachel_scott@gmail.com  4346215110
4           5    nano   beesly      w.  nano_beesly@b2x.online.com  4348662127
5           6    cozy    patel      r.   cozy_patel@b2x.online.com  4349915027
6           7    zach    scott      i.        zach_scott@yahoo.com  4344049457
7           8    cozy    scott      l.        cozy_scott@yahoo.com  4349487103
8           9     ron   vincil      b.      ron_vincil@hotmail.com  4348590255
9          10  darnel     lebo      o.       darnel_lebo@gmail.com  4349819850
10         11     abi   parnel      o.      abi_parnel@hotmail.com  4347644975
11         12     abi  stewart      h.       abi_stewart@gmail.com  4346433420
12         13     ron    lloyd      v.         ron_lloyd@yahoo.com  4348657984
13         14   egret  stewart      h.   egret_stewart@hotmail.com  4347786244
14         15  andrew   porter      a.     andrew_porter@yahoo.com  4343246027

In [55]:
# Route Data Table
command = "SELECT * FROM route;"
print(command)
pd.read_sql(command,con=cnx)

SELECT * FROM route;

,route_id,name,difficulty,rating,type,location_id
0,1,abi's lame-ass squeeze,4.0,5.0,outdoor,2
1,2,grace's timid tumble,5.3,5.0,outdoor,8
2,3,sherry's hard-ass manuever,4.9,8.0,outdoor,10
3,4,veer's terrible squeeze,5.3,4.0,outdoor,1
4,5,andrew's timid squeeze,5.0,6.0,outdoor,9
5,6,andy's inspiring hike,4.2,10.0,outdoor,6
6,7,darnel's piece-of-cake boulder-problem,4.3,7.0,outdoor,8
7,8,tyler's indubious scramble,4.8,8.0,outdoor,10
8,9,abi's downright-difficult challenge,5.1,7.0,outdoor,5
9,10,andrew's incredible tumble,5.2,10.0,outdoor,2
10,11,cozy's indubious challenge,4.8,6.0,outdoor,2
11,12,shrimp's scary-ass manuever,5.0,7.0,outdoor,2
12,13,nano's piece-of-cake tumble,4.1,8.0,outdoor,8
13,14,nano's incredible squeeze,5.3,4.0,outdoor,9
14,15,willy's downright-difficult hike,5.8,10.0,outdoor,1
15,16,willy's downright-difficult manuever,4.8,9.0,outdoor,3
16,17,willy's tricky tumble,5.4,8.0,outdoor,4
17,18,sherry's awful ascent,4.0,8.0,outdoor,8
18,19,alex's scary-ass scramble,4.1,7.0,outdoor,2
19,20,andrew's terrible manuever,5.3,6.0,outdoor,8
20,21,nano's inspiring ascent,4.1,4.0,outdoor,7
21,22,darnel's tricky boulder-problem,5.5,9.0,outdoor,3
22,23,alex's timid scramble,4.3,5.0,outdoor,1
23,24,rachel's tricky scramble,4.8,6.0,outdoor,10
24,25,sherry's tricky boulder-problem,4.0,9.0,outdoor,1
25,26,darnel's scary-ass hike,4.9,10.0,outdoor,1
26,27,shrimp's cringy tumble,5.7,5.0,outdoor,3
27,28,shrimp's incredible bluff,6.0,6.0,outdoor,10
28,29,zach's lame-ass ascent,4.9,5.0,outdoor,8
29,30,andrew's lame-ass manuever,4.0,5.0,outdoor,1
30,31,cozy's lame-ass tumble,4.5,8.0,outdoor,2
31,32,michael's downright-difficult boulder-problem,5.6,5.0,outdoor,7
32,33,perry's downright-difficult hurdle,5.2,9.0,outdoor,8
33,34,alex's piece-of-cake challenge,5.1,5.0,outdoor,3
34,35,perry's lame-ass tumble,4.2,5.0,outdoor,1
35,36,alex's indubious hurdle,5.7,6.0,outdoor,4
36,37,cozy's terrible scramble,5.9,9.0,outdoor,6
37,38,cozy's hard-ass hurdle,4.2,7.0,outdoor,3
38,39,zach's inspiring tumble,5.3,6.0,outdoor,6
39,40,willy's downright-difficult manuever,5.5,10.0,outdoor,4

In [56]:
# Location Data Table
command = "SELECT * FROM location;"
print(command)
pd.read_sql(command,con=cnx)

SELECT * FROM location;

,location_id,latitude,longitude,name,entrance_city,entrance_zip,entrance_address,num_routes
0,1,-77.877435,-37.251469,montauk state park,None,None,None,7
1,2,-78.773026,-37.189688,mcafees reservoir,None,None,None,6
2,3,-78.922493,-37.821166,george washington rocks,None,None,None,5
3,4,-78.576767,-38.105290,mcafees national park,None,None,None,3
4,5,-79.404652,-38.862543,appalachain nature preserve,None,None,None,1
5,6,-78.483288,-38.518816,charlottesville preserve,None,None,None,3
6,7,-77.601903,-37.906485,george washington preserve,None,None,None,2
7,8,-78.788749,-38.195219,mcafees rocks,None,None,None,7
8,9,-79.444516,-38.789354,blueridge mountain,None,None,None,2
9,10,-78.086883,-38.421640,appalachain preserve,None,None,None,4

In [57]:
# Route Setting Data Table 
command = "SELECT * FROM route_setting;"
print(command)
pd.read_sql(command,con=cnx).sort_values(by='route_id').reset_index(drop=True)

SELECT * FROM route_setting;

    route_id  person_id
0          1          2
1          1         12
2          1          4
3          2          2
4          2         12
..       ...        ...
84        38          4
85        39          2
86        39         12
87        40          2
88        40         12

[89 rows x 2 columns]

In [58]:
# Route log data table 
command = "SELECT * FROM log;"
print(command)
pd.read_sql(command,con=cnx)

SELECT * FROM log;

,log_id,person_id,comment,route_beta,route_id
0,1,14,"lots of fun, very easy course",toe hook on sharp ledge marked with chalk,26
1,2,13,hella dangerous without proper equipment,dyno from hold marked 2 onto blue overhang mar...,14
2,3,11,name is deceptive: easiest course at blueridge,use the crack to the left of red marker as pri...,16
3,4,6,too easy not worth the drive,karate kick over between boulders,34
4,5,4,more of a steep climb with small amounts of bo...,mantle blue ledge,35

In [59]:
# Route Setter Data 
command = "SELECT * FROM route_setter;"
print(command)
pd.read_sql(command,con=cnx)

SELECT * FROM route_setter;

   person_id  n_routes_created  route_setting_exp_lvl certifications
0          2                31                    7.0           None
1          4                18                    5.0           None
2         12                40                    9.0           None

In [60]:
# Climber Data Table
command = "SELECT * FROM climber;"
print(command)
pd.read_sql(command,con=cnx)

SELECT * FROM climber;

    person_id  exp_lvl  routes_attempted  is_team_member
0           1      7.0                27               0
1           2      7.0                25               1
2           3      5.0                18               1
3           4      5.0                18               1
4           6      9.0                38               1
5           7      8.0                28               1
6           8     10.0                38               1
7           9      7.0                29               1
8          10      3.0                11               1
9          11      6.0                17               1
10         12     10.0                37               1
11         13      6.0                18               1
12         14      5.0                14               1

In [61]:
# Admin Data Table
command = "SELECT * FROM admin;"
print(command)
pd.read_sql(command,con=cnx)

SELECT * FROM admin;

,person_id,has_edit_permission,has_delete_permission,has_create_permission,is_owner
0,5,1,1,0,0
1,11,1,1,1,0
2,13,1,1,1,0
3,15,1,1,1,0

## Select Rows Queries

In [77]:
# Get the contact info for all route setters 
command = '''
/*Get contact info for all route setters*/
SELECT f_name, l_name, email, phone
FROM person NATURAL JOIN route_setter;
'''
print(command)
pd.read_sql(command,con=cnx)

/*Get contact info for all route setters*/
SELECT f_name, l_name, email, phone
FROM person NATURAL JOIN route_setter;

   f_name   l_name                   email       phone
0    alex    scott    alex_scott@gmail.com  4341949978
1  rachel    scott  rachel_scott@gmail.com  4346215110
2     abi  stewart   abi_stewart@gmail.com  4346433420

In [78]:
# Get list of all people who are admin AND climbers
command = '''
/* Get list of all people who are admin AND climbers */
SELECT person_id, f_name, l_name 
FROM person NATURAL JOIN admin NATURAL JOIN climber;
'''
print(command)
pd.read_sql(command,con=cnx)

/* Get list of all people who are admin AND climbers */
SELECT person_id, f_name, l_name
FROM person NATURAL JOIN admin NATURAL JOIN climber;

   person_id f_name  l_name
0         11    abi  parnel
1         13    ron   lloyd

In [79]:
# Get all of the locations EAST (lower longitude) of charlottesville preserve
command = '''
/*Get all of the locations EAST (lower longitude) of charlottesville preserve*/
SELECT location_id, name, latitude, longitude
FROM location
WHERE longitude < (SELECT longitude
                   FROM location
                   WHERE name='charlottesville preserve');
'''
print(command)
pd.read_sql(command,con=cnx)

/*Get all of the locations EAST (lower longitude) of charlottesville preserve*/
SELECT location_id, name, latitude, longitude
FROM location
WHERE longitude < (SELECT longitude
                   FROM location
                   WHERE name='charlottesville preserve');

   location_id                         name   latitude  longitude
0            5  appalachain nature preserve -79.404652 -38.862543
1            9           blueridge mountain -79.444516 -38.789354

## Summarize Queries

In [81]:
# Get total number of routes as well as difficulty level of each route 
command = '''
/*Get total number of routes as well as difficulty level of each route*/
SELECT  (SELECT COUNT(*)
        FROM route
        WHERE difficulty BETWEEN 4 AND 5) AS easy_routes,
        (SELECT COUNT(*)
        FROM route
        WHERE difficulty BETWEEN 5.1 AND 5.4) AS medium_routes,
        (SELECT COUNT(*)
        FROM route
        WHERE difficulty BETWEEN 5.5 AND 6) AS hard_routes,
        (SELECT COUNT(*)
        FROM route) AS total_routes, 
        (SELECT COUNT(*)
        FROM location) AS total_locations
FROM    dual;
'''
print(command)
pd.read_sql(command, con=cnx)

/*Get total number of routes as well as difficulty level of each route*/
SELECT  (SELECT COUNT(*)
        FROM route
        WHERE difficulty BETWEEN 4 AND 5) AS easy_routes,
        (SELECT COUNT(*)
        FROM route
        WHERE difficulty BETWEEN 5.1 AND 5.4) AS medium_routes,
        (SELECT COUNT(*)
        FROM route
        WHERE difficulty BETWEEN 5.5 AND 6) AS hard_routes,
        (SELECT COUNT(*)
        FROM route) AS total_routes,
        (SELECT COUNT(*)
        FROM location) AS total_locations
FROM    dual;

   easy_routes  medium_routes  hard_routes  total_routes  total_locations
0           22             10            8            40               10

In [84]:
# Get average route rating for loacation as well as number of routes
command = '''
/*Get average route rating for loacation as well as number of routes*/
SELECT ROUND(AVG(rating),2) AS 'Average Rating', 
    ROUND(MIN(rating)) AS 'Min Rating',
    ROUND(MAX(rating)) AS 'Max Rating',
    ROUND(AVG(difficulty),2) AS 'Average Difficulty',
    COUNT(*) AS 'Number of Routes', 
    location.name AS 'Location Name'
FROM route JOIN location USING (location_id)
GROUP BY location_id;
'''
print(command)
pd.read_sql(command,con=cnx)

/*Get average route rating for loacation as well as number of routes*/
SELECT ROUND(AVG(rating),2) AS 'Average Rating',
    ROUND(MIN(rating)) AS 'Min Rating',
    ROUND(MAX(rating)) AS 'Max Rating',
    ROUND(AVG(difficulty),2) AS 'Average Difficulty',
    COUNT(*) AS 'Number of Routes',
    location.name AS 'Location Name'
FROM route JOIN location USING (location_id)
GROUP BY location_id;

,Average Rating,Min Rating,Max Rating,Average Difficulty,Number of Routes,Location Name
0,6.86,4.0,10.0,4.64,7,montauk state park
1,7.17,5.0,10.0,4.60,6,mcafees reservoir
2,7.00,5.0,9.0,5.06,5,george washington rocks
3,8.00,6.0,10.0,5.53,3,mcafees national park
4,7.00,7.0,7.0,5.10,1,appalachain nature preserve
5,8.33,6.0,10.0,5.13,3,charlottesville preserve
6,4.50,4.0,5.0,4.85,2,george washington preserve
7,6.86,5.0,9.0,4.73,7,mcafees rocks
8,5.00,4.0,6.0,5.15,2,blueridge mountain
9,7.00,6.0,8.0,5.13,4,appalachain preserve

In [85]:
# Get the total number of each type of system user
command = '''
/*Get the total number of each type of system user*/
SELECT  (SELECT COUNT(*)
        FROM   climber) AS count_climber,
        (SELECT COUNT(*)
        FROM   route_setter) AS count_route_setter,
        (SELECT COUNT(*)
        FROM `admin`) AS count_admin,
        (SELECT COUNT(*)
        FROM person) AS count_total
FROM    dual;
'''
print(command)
pd.read_sql(command,con=cnx)

/*Get the total number of each type of system user*/
SELECT  (SELECT COUNT(*)
        FROM   climber) AS count_climber,
        (SELECT COUNT(*)
        FROM   route_setter) AS count_route_setter,
        (SELECT COUNT(*)
        FROM `admin`) AS count_admin,
        (SELECT COUNT(*)
        FROM person) AS count_total
FROM    dual;

   count_climber  count_route_setter  count_admin  count_total
0             13                   3            4           15

In [89]:
command = '''
/*See what type of person each person is*/
SELECT person_id, CONCAT(f_name,' ',`initial`,' ',l_name) AS 'full_name', 
    exp_lvl IS NOT NULL AS 'is_climber', 
    route_setter.route_setting_exp_lvl IS NOT NULL AS 'is_route_setter', 
    `admin`.has_edit_permission IS NOT NULL AS 'is_admin'
FROM person LEFT JOIN climber USING (person_id) LEFT JOIN route_setter USING (person_id) LEFT JOIN `admin` USING (person_id);
'''
print(command)
pd.read_sql(command,con=cnx)

/*See what type of person each person is*/
SELECT person_id, CONCAT(f_name,' ',`initial`,' ',l_name) AS 'full_name',
    exp_lvl IS NOT NULL AS 'is_climber',
    route_setter.route_setting_exp_lvl IS NOT NULL AS 'is_route_setter',
    `admin`.has_edit_permission IS NOT NULL AS 'is_admin'
FROM person LEFT JOIN climber USING (person_id) LEFT JOIN route_setter USING (person_id) LEFT JOIN `admin` USING (person_id);

    person_id         full_name  is_climber  is_route_setter  is_admin
0           1     zach v. patel           1                0         0
1           2     alex s. scott           1                1         0
2           3    veer v. beesly           1                0         0
3           4   rachel g. scott           1                1         0
4           5    nano w. beesly           0                0         1
5           6     cozy r. patel           1                0         0
6           7     zach i. scott           1                0         0
7           8     cozy l. scott           1                0         0
8           9     ron b. vincil           1                0         0
9          10    darnel o. lebo           1                0         0
10         11     abi o. parnel           1                0         1
11         12    abi h. stewart           1                1         0
12         13      ron v. lloyd           1                0         1
13         14  egret h. stewart           1                0         0
14         15  andrew a. porter           0                0         1

## Generate Master Report

In [86]:
# Master Data file of all of the routes from all of the locations, their difficulty, rating, type, comments and beta 
command = '''
/*Master Data file of all of the routes from all of the locations, their difficulty, rating, type, comments and beta*/
SELECT location_id, route_id, latitude, longitude, 
location.name AS 'location name', route.name AS 'route name', 
difficulty, rating, route.`type`, `log`.`comment`, `log`.`route_beta`
FROM location JOIN route USING (location_id) LEFT JOIN `log` USING (route_id);
'''
print(command)
pd.read_sql(command,con=cnx)

/*Master Data file of all of the routes from all of the locations, their difficulty, rating, type, comments and beta*/
SELECT location_id, route_id, latitude, longitude,
location.name AS 'location name', route.name AS 'route name',
difficulty, rating, route.`type`, `log`.`comment`, `log`.`route_beta`
FROM location JOIN route USING (location_id) LEFT JOIN `log` USING (route_id);

,location_id,route_id,latitude,longitude,location name,route name,difficulty,rating,type,comment,route_beta
0,1,4,-77.877435,-37.251469,montauk state park,veer's terrible squeeze,5.3,4.0,outdoor,None,None
1,1,15,-77.877435,-37.251469,montauk state park,willy's downright-difficult hike,5.8,10.0,outdoor,None,None
2,1,23,-77.877435,-37.251469,montauk state park,alex's timid scramble,4.3,5.0,outdoor,None,None
3,1,25,-77.877435,-37.251469,montauk state park,sherry's tricky boulder-problem,4.0,9.0,outdoor,None,None
4,1,26,-77.877435,-37.251469,montauk state park,darnel's scary-ass hike,4.9,10.0,outdoor,"lots of fun, very easy course",toe hook on sharp ledge marked with chalk
5,1,30,-77.877435,-37.251469,montauk state park,andrew's lame-ass manuever,4.0,5.0,outdoor,None,None
6,1,35,-77.877435,-37.251469,montauk state park,perry's lame-ass tumble,4.2,5.0,outdoor,more of a steep climb with small amounts of bo...,mantle blue ledge
7,2,1,-78.773026,-37.189688,mcafees reservoir,abi's lame-ass squeeze,4.0,5.0,outdoor,None,None
8,2,10,-78.773026,-37.189688,mcafees reservoir,andrew's incredible tumble,5.2,10.0,outdoor,None,None
9,2,11,-78.773026,-37.189688,mcafees reservoir,cozy's indubious challenge,4.8,6.0,outdoor,None,None
10,2,12,-78.773026,-37.189688,mcafees reservoir,shrimp's scary-ass manuever,5.0,7.0,outdoor,None,None
11,2,19,-78.773026,-37.189688,mcafees reservoir,alex's scary-ass scramble,4.1,7.0,outdoor,None,None
12,2,31,-78.773026,-37.189688,mcafees reservoir,cozy's lame-ass tumble,4.5,8.0,outdoor,None,None
13,3,16,-78.922493,-37.821166,george washington rocks,willy's downright-difficult manuever,4.8,9.0,outdoor,name is deceptive: easiest course at blueridge,use the crack to the left of red marker as pri...
14,3,22,-78.922493,-37.821166,george washington rocks,darnel's tricky boulder-problem,5.5,9.0,outdoor,None,None
15,3,27,-78.922493,-37.821166,george washington rocks,shrimp's cringy tumble,5.7,5.0,outdoor,None,None
16,3,34,-78.922493,-37.821166,george washington rocks,alex's piece-of-cake challenge,5.1,5.0,outdoor,too easy not worth the drive,karate kick over between boulders
17,3,38,-78.922493,-37.821166,george washington rocks,cozy's hard-ass hurdle,4.2,7.0,outdoor,None,None
18,4,17,-78.576767,-38.105290,mcafees national park,willy's tricky tumble,5.4,8.0,outdoor,None,None
19,4,36,-78.576767,-38.105290,mcafees national park,alex's indubious hurdle,5.7,6.0,outdoor,None,None
20,4,40,-78.576767,-38.105290,mcafees national park,willy's downright-difficult manuever,5.5,10.0,outdoor,None,None
21,5,9,-79.404652,-38.862543,appalachain nature preserve,abi's downright-difficult challenge,5.1,7.0,outdoor,None,None
22,6,6,-78.483288,-38.518816,charlottesville preserve,andy's inspiring hike,4.2,10.0,outdoor,None,None
23,6,37,-78.483288,-38.518816,charlottesville preserve,cozy's terrible scramble,5.9,9.0,outdoor,None,None
24,6,39,-78.483288,-38.518816,charlottesville preserve,zach's inspiring tumble,5.3,6.0,outdoor,None,None
25,7,21,-77.601903,-37.906485,george washington preserve,nano's inspiring ascent,4.1,4.0,outdoor,None,None
26,7,32,-77.601903,-37.906485,george washington preserve,michael's downright-difficult boulder-problem,5.6,5.0,outdoor,None,None
27,8,2,-78.788749,-38.195219,mcafees rocks,grace's timid tumble,5.3,5.0,outdoor,None,None
28,8,7,-78.788749,-38.195219,mcafees rocks,darnel's piece-of-cake boulder-problem,4.3,7.0,outdoor,None,None
29,8,13,-78.788749,-38.195219,mcafees rocks,nano's piece-of-cake tumble,4.1,8.0,outdoor,None,None
30,8,18,-78.788749,-38.195219,mcafees rocks,sherry's awful ascent,4.0,8.0,outdoor,None,None
31,8,20,-78.788749,-38.195219,mcafees rocks,andrew's terrible manuever,5.3,6.0,outdoor,None,None
32,8,29,-78.788749,-38.195219,mcafees rocks,zach's lame-ass ascent,4.9,5.0,outdoor,None,None
33,8,33,-78.788749,-38.195219,mcafees rocks,perry's downright-difficult hurdle,5.2,9.0,outdoor,None,None
34,9,5,-79.444516,-38.789354,blueridge mountain,andrew's timid squeeze,5.0,6.0,outdoor,None,None
35,9,14,-79.444516,-38.789354,blueridge mountain,nano's incredible squeeze,5.3,4.0,outdoor,hella dangerous without proper equipment,dyno from hold marked 2 onto blue overhang mar...
36,10,3,-78.086883,-38.421640,appalachain preserve,sherry's hard-ass manuever,4.9,8.0,outdoor,None,None
37,10,8,-78.086883,-38.421640,appalachain preserve,tyler's indubious scramble,4.8,8.0,outdoor,None,None
38,10,24,-78.086883,-38.421640,appalachain preserve,rachel's tricky scramble,4.8,6.0,outdoor,None,None
39,10,28,-78.086883,-38.421640,appalachain preserve,shrimp's incredible bluff,6.0,6.0,outdoor,None,None

In [87]:
# Master Data File of all of the people in our database
command='''
/*Master Data File of all of the people in our database*/
SELECT person_id, CONCAT(f_name,' ',`initial`,' ',l_name) AS 'Full Name',
    exp_lvl IS NOT NULL AS 'is_climber', 
    route_setter.route_setting_exp_lvl IS NOT NULL AS 'is_route_setter', 
    `admin`.has_edit_permission IS NOT NULL AS 'is_admin',
    exp_lvl AS 'Climbing Experience Level', 
    route_setter.route_setting_exp_lvl AS 'Route Setting Experience Level', 
    `admin`.has_edit_permission AS 'Admin Edit Permission'
FROM person LEFT JOIN climber USING (person_id) LEFT JOIN route_setter USING (person_id) LEFT JOIN `admin` USING (person_id);
'''
print(command)
pd.read_sql(command,con=cnx)

/*Master Data File of all of the people in our database*/
SELECT person_id, CONCAT(f_name,' ',`initial`,' ',l_name) AS 'Full Name',
    exp_lvl IS NOT NULL AS 'is_climber',
    route_setter.route_setting_exp_lvl IS NOT NULL AS 'is_route_setter',
    `admin`.has_edit_permission IS NOT NULL AS 'is_admin',
    exp_lvl AS 'Climbing Experience Level',
    route_setter.route_setting_exp_lvl AS 'Route Setting Experience Level',
    `admin`.has_edit_permission AS 'Admin Edit Permission'
FROM person LEFT JOIN climber USING (person_id) LEFT JOIN route_setter USING (person_id) LEFT JOIN `admin` USING (person_id);

,person_id,Full Name,is_climber,is_route_setter,is_admin,Climbing Experience Level,Route Setting Experience Level,Admin Edit Permission
0,1,zach v. patel,1,0,0,7.0,NaN,NaN
1,2,alex s. scott,1,1,0,7.0,7.0,NaN
2,3,veer v. beesly,1,0,0,5.0,NaN,NaN
3,4,rachel g. scott,1,1,0,5.0,5.0,NaN
4,5,nano w. beesly,0,0,1,NaN,NaN,1.0
5,6,cozy r. patel,1,0,0,9.0,NaN,NaN
6,7,zach i. scott,1,0,0,8.0,NaN,NaN
7,8,cozy l. scott,1,0,0,10.0,NaN,NaN
8,9,ron b. vincil,1,0,0,7.0,NaN,NaN
9,10,darnel o. lebo,1,0,0,3.0,NaN,NaN
10,11,abi o. parnel,1,0,1,6.0,NaN,1.0
11,12,abi h. stewart,1,1,0,10.0,9.0,NaN
12,13,ron v. lloyd,1,0,1,6.0,NaN,1.0
13,14,egret h. stewart,1,0,0,5.0,NaN,NaN
14,15,andrew a. porter,0,0,1,NaN,NaN,1.0

## Associated Entity Join

In [88]:
command = '''
/*Join together the tables with many to many connections through the associated entity table*/
SELECT route.name AS 'route_name', CONCAT(person.f_name, ' ',person.`initial`, ' ',person.l_name) AS 'creator_name', 
    person_id, route_id
FROM route_setting JOIN person USING (person_id) JOIN route USING (route_id)
'''
print(command)
pd.read_sql(command,con=cnx).sample(10)

/*Join together the tables with many to many connections through the associated entity table*/
SELECT route.name AS 'route_name', CONCAT(person.f_name, ' ',person.`initial`, ' ',person.l_name) AS 'creator_name',
    person_id, route_id
FROM route_setting JOIN person USING (person_id) JOIN route USING (route_id)

                            route_name     creator_name  person_id  route_id
7           cozy's indubious challenge    alex s. scott          2        11
29             zach's inspiring tumble    alex s. scott          2        39
78          andrew's lame-ass manuever   abi h. stewart         12        30
50                grace's timid tumble   abi h. stewart         12         2
16     sherry's tricky boulder-problem    alex s. scott          2        25
60         shrimp's scary-ass manuever   abi h. stewart         12        12
42              zach's lame-ass ascent  rachel g. scott          4        29
19           shrimp's incredible bluff    alex s. scott          2        28
24  perry's downright-difficult hurdle    alex s. scott          2        33
70     darnel's tricky boulder-problem   abi h. stewart         12        22

In [80]:
# Close your connection 
conn.close()